TcMenu/tcMenuLib/examples/arduino32/Stm32DashEth/Stm32DashEth_menu.h
/*
    The code in this file uses open source libraries provided by thecoderscorner

    DO NOT EDIT THIS FILE, IT WILL BE GENERATED EVERY TIME YOU USE THE UI DESIGNER
    INSTEAD EITHER PUT CODE IN YOUR SKETCH OR CREATE ANOTHER SOURCE FILE.

    All the variables you may need access to are marked extern in this file for easy
    use elsewhere.
 */

#ifndef MENU_GENERATED_CODE_H
#define MENU_GENERATED_CODE_H

// PLUGIN FILE - tcMenuU8g2.h
/*
 * Copyright (c) 2018 https://www.thecoderscorner.com (Dave Cherry).
 * This product is licensed under an Apache license, see the LICENSE file in the top-level directory.
 */

/**
 * @file tcMenuU8g2.h
 * 
 * U8g2 renderer that renders menus onto this type of display. This file is a plugin file and should not
 * be directly edited, it will be replaced each time the project is built. If you want to edit this file in place,
 * make sure to rename it first.
 * 
 * LIBRARY REQUIREMENT
 * This library requires the u8g2 library available for download from your IDE library manager.
 */

#ifndef _TCMENU_U8G2_H_
#define _TCMENU_U8G2_H_

#include <tcMenu.h>
#include <tcUtil.h>
#include <Wire.h>
#include <U8g2lib.h>
#include <graphics/BaseGraphicalRenderer.h>
#include <graphics/GraphicsDeviceRenderer.h>
#include <BaseDialog.h>
#include <tcUtil.h>


// If you DONT want task manager yield code in I2C set to 0
#ifndef WANT_TASK_MANAGER_FRIENDLY_YIELD
#define WANT_TASK_MANAGER_FRIENDLY_YIELD 0
#endif // WANT_TASK_MANAGER_FRIENDLY_YIELD

using namespace tcgfx;

/**
 * A standard menu render configuration that describes how to renderer each item and the title.
 * Specialised for u8g2 fonts.
 */
typedef struct ColorGfxMenuConfig<const uint8_t*> U8g2GfxMenuConfig;

// some colour displays don't create this value
#ifndef BLACK
#define BLACK 0
#endif

// some colour displays don't create this value
#ifndef WHITE
#define WHITE 1
#endif

/**
 * This is used to draw to I2C including a task manager yield to improve performance on slower I2C devices.
 * Not really needed for SPI as we are talking in low order millis for a full refresh.
 */
uint8_t u8g2_byte_with_yield(u8x8_t *u8x8, uint8_t msg, uint8_t arg_int, void *arg_ptr);

/**
 * A basic renderer that can use the AdaFruit_GFX library to render information onto a suitable
 * display. It is your responsibility to fully initialise and prepare the display before passing
 * it to this renderer. The usual procedure is to create a display variable globally in your
 * sketch and then provide that as the parameter to setGraphicsDevice. If you are using the
 * designer you provide the display variable name in the code generation parameters.
 *
 * You can also override many elements of the display using AdaColorGfxMenuConfig, to use the defaults
 * just call prepareAdaColorDefaultGfxConfig(..) passing it a pointer to your config object. Again the
 * designer UI takes care of this.
 */
class U8g2Drawable : public DeviceDrawable {
private:
	U8G2* u8g2;
#if WANT_TASK_MANAGER_FRIENDLY_YIELD == 1
    static TwoWire* pWire;
    friend uint8_t u8g2_byte_with_yield(u8x8_t *u8x8, uint8_t msg, uint8_t arg_int, void *arg_ptr);
#endif // WANT_TASK_MANAGER_FRIENDLY_YIELD
public:
    explicit U8g2Drawable(U8G2* u8g2, TwoWire* wire = nullptr);
    ~U8g2Drawable() override = default;

    DeviceDrawable* getSubDeviceFor(const Coord &where, const Coord &size, const color_t *palette, int paletteSize) override {return nullptr; }

    void internalDrawText(const Coord &where, const void *font, int mag, const char *text) override;
    void drawBitmap(const Coord &where, const DrawableIcon *icon, bool selected) override;
    void drawXBitmap(const Coord &where, const Coord &size, const uint8_t *data) override;
    void drawBox(const Coord &where, const Coord &size, bool filled) override;
    void drawCircle(const Coord &where, int radius, bool filled) override;
    void drawPolygon(const Coord *points, int numPoints, bool filled) override;

    Coord getDisplayDimensions() override {  return Coord(u8g2->getWidth(), u8g2->getHeight()); }
    void transaction(bool isStarting, bool redrawNeeded) override;
    Coord internalTextExtents(const void *font, int mag, const char *text, int *baseline) override;
    color_t getUnderlyingColor(color_t col) override { return (col<4) ? col : 1; }
protected:
    void drawPixel(uint16_t x, uint16_t y) override;
    UnicodeFontHandler *createFontHandler() override;
};

#endif // _TCMENU_U8G2_H_


// PLUGIN FILE - EthernetTransport.h
/*
 * Copyright (c) 2018 https://www.thecoderscorner.com (Dave Cherry).
 * This product is licensed under an Apache license, see the LICENSE file in the top-level directory.
 */

/**
 * @file EthernetTransport.h
 * 
 * Ethernet remote capability plugin. This file is a plugin file and should not be directly edited,
 * it will be replaced each time the project is built. If you want to edit this file in place,
 * make sure to rename it first.
 */

#ifndef TCMENU_ETHERNETTRANSPORT_H_
#define TCMENU_ETHERNETTRANSPORT_H_

#include <RemoteConnector.h>
#include <TaskManager.h>
#include <STM32Ethernet.h>
#include <tcUtil.h>
#include <remote/BaseRemoteComponents.h>

#ifndef ETHERNET_BUFFER_SIZE
#define ETHERNET_BUFFER_SIZE 0
#endif

#if ETHERNET_BUFFER_SIZE > 0
#include <remote/BaseBufferedRemoteTransport.h>
#endif

namespace tcremote {

#if ETHERNET_BUFFER_SIZE > 0

/**
 * An implementation of TagValueTransport that is able to read and write via a buffer to sockets.
 */
    class EthernetTagValTransport : public tcremote::BaseBufferedRemoteTransport {
    private:
        EthernetClient client;
    public:
        EthernetTagValTransport() : BaseBufferedRemoteTransport(BUFFER_MESSAGES_TILL_FULL, ETHERNET_BUFFER_SIZE, MAX_VALUE_LEN) { }
        ~EthernetTagValTransport() override = default;
        void setClient(EthernetClient cl) { this->client = cl; }

        int fillReadBuffer(uint8_t* data, int maxSize) override;
        void flush() override;
        bool available() override;
        bool connected() override;
        void close() override;
    };

#else // ethernet buffering not needed

/**
 * An implementation of TagValueTransport that is able to read and write using sockets.
 */
class EthernetTagValTransport : public TagValueTransport {
private:
	EthernetClient client;
public:
	EthernetTagValTransport() : TagValueTransport(TagValueTransportType::TVAL_UNBUFFERED) {};
	~EthernetTagValTransport() override = default;
	void setClient(EthernetClient client) { this->client = client; }

	int writeChar(char data) override ;
	int writeStr(const char* data) override;
	void flush() override;
	bool available() override;
	bool connected() override;
	uint8_t readByte() override;
	bool readAvailable() override;
    void close() override;
};

#endif // ethernet buffering check

/**
 * This class provides the initialisation and connection generation logic for ethernet connections.
 */
class EthernetInitialisation : public DeviceInitialisation {
private:
	EthernetServer *server;
public:
    explicit EthernetInitialisation(EthernetServer* server) : server(server) {}

    bool attemptInitialisation() override;

    bool attemptNewConnection(BaseRemoteServerConnection *transport) override;
};

/**
 * This function converts from a RSSI (Radio Strength indicator)
 * measurement into a series of icons (of the ones we have defined
 * in the stock icons. The input is the RSSI figure in dB as an
 * integer.
 * @param strength the signal strength (usually negative) as an int
 * @return a state that can be used with the standard wifi TitleWidget
 */
int fromWiFiRSSITo4StateIndicator(int strength);

} // namespace tcremote

#ifndef TC_MANUAL_NAMESPACING
using namespace tcremote;
#endif // TC_MANUAL_NAMESPACING

#endif /* TCMENU_ETHERNETTRANSPORT_H_ */

#include <Arduino.h>
#include <tcMenu.h>

#include <tcMenuBuilder.h>
#include <StateMachineEncoder.h>
#include <RemoteConnector.h>
#include <ScrollChoiceMenuItem.h>
#include <RemoteMenuItem.h>
#include <EditableLargeNumberMenuItem.h>
#include <IoAbstraction.h>
#include <EepromItemStorage.h>
#include <mbed/HalStm32EepromAbstraction.h>
#include <RemoteAuthentication.h>

// variables we declare that you may need to access
extern const PROGMEM ConnectorLocalInfo applicationInfo;
extern TcMenuRemoteServer remoteServer;
extern U8G2_SSD1306_128X64_NONAME_F_4W_HW_SPI gfx;
extern U8g2Drawable gfxDrawable;
extern GraphicsDeviceRenderer renderer;
extern EthernetServer server;
extern EthernetInitialisation ethernetInitialisation;

// Any externals needed by IO expanders, EEPROMs etc


// Forward define the menu builder function
void buildMenu(TcMenuBuilder& builder);

// The following defines all menu item IDs.
#define MENU_33_ID  19
#define MENU_45_ID  20
#define MENU_78_ID  21
#define MENU_STATUS_CARDS_ID  32
#define MENU_STATUS_CARDS_ACE_ID  33
#define MENU_STATUS_CARDS_CLUB_ID  34
#define MENU_STATUS_CARDS_HRTS_ID  35
#define MENU_STATUS_CARDS_DMND_ID  36
#define MENU_STATUS_ID  22
#define MENU_STATUS_CURRENT_ID  23
#define MENU_STATUS_MOTOR_ID  24
#define MENU_STATUS_WO_W_ID  25
#define MENU_SETTINGS_ID  26
#define MENU_SETTINGS_OFST33_ID  27
#define MENU_SETTINGS_OFST45_ID  28
#define MENU_SETTINGS_OFST78_ID  29
#define MENU_SETTINGS_DEFAULT_ID  30
#define MENU_SETTINGS_SAVE_NOW_ID  31
#define MENU_MORE_ITEMS_ID  4
#define MENU_MORE_ITEMS_OPTIONS_ID  5
#define MENU_MORE_ITEMS_TOPPINGS_ID  6
#define MENU_MORE_ITEMS_POWER_ID  7
#define MENU_MORE_ITEMS_PRESS_ME_ID  8
#define MENU_MORE_ITEMS_NUMBER_ID  9
#define MENU_MORE_ITEMS_SCROLL_ID  10
#define MENU_RUNTIMES_ID  11
#define MENU_RUNTIMES_TEXT_ID  12
#define MENU_RUNTIMES_CUSTOM_LIST_ID  13
#define MENU_RUNTIMES_IO_TMONITOR_ID  14
#define MENU_RUNTIMES_AUTHENTICATOR_ID  15
#define MENU_RUNTIMES_HALVES1_ID  17
#define MENU_RUNTIMES_LGE_NUM1_ID  18
#define MENU_DECIMAL_ID  1
#define MENU_DECIMAL_STEP_ID  16

// Inline helper methods to access menu items
inline ActionMenuItem& getMenu33() { return getActionItemById(MENU_33_ID); }
inline ActionMenuItem& getMenu45() { return getActionItemById(MENU_45_ID); }
inline ActionMenuItem& getMenu78() { return getActionItemById(MENU_78_ID); }
inline SubMenuItem& getMenuStatusCards() { return getSubMenuById(MENU_STATUS_CARDS_ID); }
inline ActionMenuItem& getMenuStatusCardsAce() { return getActionItemById(MENU_STATUS_CARDS_ACE_ID); }
inline ActionMenuItem& getMenuStatusCardsClub() { return getActionItemById(MENU_STATUS_CARDS_CLUB_ID); }
inline ActionMenuItem& getMenuStatusCardsHrts() { return getActionItemById(MENU_STATUS_CARDS_HRTS_ID); }
inline ActionMenuItem& getMenuStatusCardsDmnd() { return getActionItemById(MENU_STATUS_CARDS_DMND_ID); }
inline SubMenuItem& getMenuStatus() { return getSubMenuById(MENU_STATUS_ID); }
inline AnalogMenuItem& getMenuStatusCurrent() { return getAnalogItemById(MENU_STATUS_CURRENT_ID); }
inline AnalogMenuItem& getMenuStatusMotor() { return getAnalogItemById(MENU_STATUS_MOTOR_ID); }
inline AnalogMenuItem& getMenuStatusWoW() { return getAnalogItemById(MENU_STATUS_WO_W_ID); }
inline SubMenuItem& getMenuSettings() { return getSubMenuById(MENU_SETTINGS_ID); }
inline AnalogMenuItem& getMenuSettingsOfst33() { return getAnalogItemById(MENU_SETTINGS_OFST33_ID); }
inline AnalogMenuItem& getMenuSettingsOfst45() { return getAnalogItemById(MENU_SETTINGS_OFST45_ID); }
inline AnalogMenuItem& getMenuSettingsOfst78() { return getAnalogItemById(MENU_SETTINGS_OFST78_ID); }
inline EnumMenuItem& getMenuSettingsDefault() { return getEnumItemById(MENU_SETTINGS_DEFAULT_ID); }
inline ActionMenuItem& getMenuSettingsSaveNow() { return getActionItemById(MENU_SETTINGS_SAVE_NOW_ID); }
inline SubMenuItem& getMenuMoreItems() { return getSubMenuById(MENU_MORE_ITEMS_ID); }
inline EnumMenuItem& getMenuMoreItemsOptions() { return getEnumItemById(MENU_MORE_ITEMS_OPTIONS_ID); }
inline BooleanMenuItem& getMenuMoreItemsToppings() { return getBooleanItemById(MENU_MORE_ITEMS_TOPPINGS_ID); }
inline BooleanMenuItem& getMenuMoreItemsPower() { return getBooleanItemById(MENU_MORE_ITEMS_POWER_ID); }
inline ActionMenuItem& getMenuMoreItemsPressMe() { return getActionItemById(MENU_MORE_ITEMS_PRESS_ME_ID); }
inline FloatMenuItem& getMenuMoreItemsNumber() { return getFloatItemById(MENU_MORE_ITEMS_NUMBER_ID); }
inline ScrollChoiceMenuItem& getMenuMoreItemsScroll() { return getScrollChoiceItemById(MENU_MORE_ITEMS_SCROLL_ID); }
inline SubMenuItem& getMenuRuntimes() { return getSubMenuById(MENU_RUNTIMES_ID); }
inline TextMenuItem& getMenuRuntimesText() { return getTextItemById(MENU_RUNTIMES_TEXT_ID); }
inline ListRuntimeMenuItem& getMenuRuntimesCustomList() { return getListItemById(MENU_RUNTIMES_CUSTOM_LIST_ID); }
inline RemoteMenuItem& getMenuRuntimesIoTMonitor() { return getIoTRemoteMenuById(MENU_RUNTIMES_IO_TMONITOR_ID); }
inline EepromAuthenticationInfoMenuItem& getMenuRuntimesAuthenticator() { return getAuthenticationMenuById(MENU_RUNTIMES_AUTHENTICATOR_ID); }
inline AnalogMenuItem& getMenuRuntimesHalves1() { return getAnalogItemById(MENU_RUNTIMES_HALVES1_ID); }
inline EditableLargeNumberMenuItem& getMenuRuntimesLgeNum1() { return getLargeNumberItemById(MENU_RUNTIMES_LGE_NUM1_ID); }
inline AnalogMenuItem& getMenuDecimal() { return getAnalogItemById(MENU_DECIMAL_ID); }
inline EnumMenuItem& getMenuDecimalStep() { return getEnumItemById(MENU_DECIMAL_STEP_ID); }


// Provide a wrapper to get hold of the root menu item and export setupMenu
inline MenuItem& rootMenuItem() { return getMenu33(); }
void setupMenu();

// Callback functions must always include CALLBACK_FUNCTION after the return type
#define CALLBACK_FUNCTION

void CALLBACK_FUNCTION decimalDidChange(int id);
int fnRuntimesCustomListRtCall(RuntimeMenuItem* item, uint8_t row, RenderFnMode mode, char* buffer, int bufferSize);
void CALLBACK_FUNCTION largeNumDidChange(int id);
void CALLBACK_FUNCTION onDecimalStepChange(int id);
void CALLBACK_FUNCTION saveWasPressed(int id);

#endif // MENU_GENERATED_CODE_H